Reports/20191109_222726/Data Driven/SOAP API Test Suite/20191109_222726/requests/main/10.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-11-09T16:27:46.125Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <LanguageName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n            <sISOCode>${languageISO}</sISOCode>\n        </LanguageName>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 359,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:LanguageNameResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:LanguageNameResult>Language ISO Code not found!</m:LanguageNameResult>\r\n    </m:LanguageNameResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 163,
        "bodySize" : 359,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 2806,
        "blocked" : -1,
        "receive" : 0,
        "send" : 0,
        "wait" : 0,
        "dns" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "10",
        "testObjectId" : "Object Repository/Country API/More Services/Language Name",
        "harId" : "1418fd5f-5ca1-4169-b6b8-2a8f641cfe2f",
        "reportFolder" : null
      },
      "time" : 2806
    } ],
    "comment" : ""
  }
}